spec/dummy/app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "description", "end_date", "judgement_day", "payday", "start_date", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])
    @event.save!